sh/readme.ja.org
# -*- mode: org ; coding: utf-8-unix -*-
# last updated : 2021/05/02.17:56:26


#+TITLE:     LLVM Build Shell by bash
#+AUTHOR:    yaruopooner [https://github.com/yaruopooner]
#+OPTIONS:   author:nil timestamp:t |:t \n:t ^:nil


* 使用方法
  このシェルではLinux or CYGWINのLLVMがビルド可能です。
  llvm-builder.shが本体です。
  sample.shが呼び出しサンプルです。
  patchパスなど必要に応じて編集してください。

* セルフビルドに必要なソフトウェア
  以下が必要になります。

** Git
   #+begin_src shell-script
     $ sudo apt-get install git
   #+end_src

** CMake
   #+begin_src shell-script
     $ sudo apt-get install cmake
   #+end_src

   最新版の場合は↓からダウンロード

   http://www.cmake.org/

   最新版をダウンロードし解凍、ビルド、インストールを行う。

   #+begin_src shell-script
     $ wget --timestamping https://cmake.org/files/v3.6/cmake-3.6.2-win64-x64.zip
     $ tar -xvf cmake-3.6.2.tar.gz
     $ cd cmake-3.6.2
     $ ./configure && make
     $ make install
   #+end_src

** Python 3.6.x
   LLVM 12.0.X から必要。

** Python 2.7.x
   LLVM 11.0.X までは必要。

* セルフビルド
  Bash版を使用します。

  llvm-build-shellsでは以下を一括で行います。
  - LLVMレポジトリのクローンとチェックアウト
  - パッチ適用(optional)
  - cmakeによるLLVM Makefile生成
  - ビルド

** パッチ
   sample.shでパッチのパスを設定する必要があります。

   [[../patch/details.org][Patch Details]]

